LEXICON_RU = {
    # buttons
    'main_menu_reply': '🗂 Главное меню',
    'set_up_search': '🎯 Настроить поиск',
    'add_ad': '➕ Добавить объявление',
    'favorites': '🌟 Избранное',
    'support': '📲 Поддержка',
    'cancel': '❌ Отмена',
    'any_option': '🔄 Любой вариант',
    'back': '🔙 Назад',
    'next': '➡️ Далее',
    'sell': '🏠 Продажа',
    'rent': '🏡 Аренда',
    'sale': '🏠 Покупка',
    'buy': '🏠 Покупка',


    'choice_city': '🏙 Выберите город',
    'mersin': '📍 Мерсин',
    'antalya': '🏙 Анталия',
    'tamyuk': '📍 Тамюк',
    'tedje': '📍 Тедже',
    'new_building': '🏗 Новостройки',
    'secondary': '🏠 Вторичное',
    'rooms_1_0': '1+0 🛏',
    'rooms_1_1': '1+1 🛏',
    'rooms_2_1': '2+1 🛏',
    'rooms_3_1': '3+1 🛏',
    'rooms_4_1': '4+1 🛏',
    'rooms_5_1_more': '5+1 и более 🛏',
    'villa': '🏡 Вилла',
    'only_owner': '☑️ Только от собственника',
    'all_params': '👀 Смотреть все объявления',
    'back_to_settings': '🔄 Назад к настройкам',
    'start_search': '🔍 Начать поиск',
    'start_search_without_filters': '🧭 Поиск без фильтров',

    # buttons for prices (аренда)
    'rent_price_1000': 'до 1000€',
    'rent_price_2000': 'до 2000€',
    'rent_price_3000': 'до 3000€',
    'rent_price_4000': 'до 4000€',
    'rent_price_5000': 'до 5000€',
    'rent_price_6000': 'до 6000€',
    'rent_price_7000': 'до 7000€',
    'rent_price_8000': 'до 8000€',
    'rent_price_9000': 'до 9000€',
    'rent_price_10000': 'до 10000€',
    'rent_price_13000': 'до 13000€',
    'rent_price_15000': 'до 15000€',

    # buttons for prices (покупка)
    'buy_price_50000': 'до 50 000 €',
    'buy_price_100000': 'до 100 000 €',
    'buy_price_200000': 'до 200 000 €',
    'buy_price_300000': 'до 300 000 €',
    'buy_price_500000': 'до 500 000 €',
    'buy_price_1000000': 'до 1 000 000 €',

    # buttons for area
    'area_40m': 'от 40м²',
    'area_50m': 'от 50м²',
    'area_60m': 'от 60м²',
    'area_70m': 'от 70м²',
    'area_80m': 'от 80м²',
    'area_100m': 'от 100м²',
    'area_120m': 'от 120м²',
    'area_150m': 'от 150м²',
    'area_200m': 'от 200м²',
    'area_0m': '∞ (без ограничений)',

    # texts (существующие)
    'welcome_text': '''
<b>Добро пожаловать в Real Estate Bot! 👋</b>
Я — бот-помощник, который поможет вам найти, арендовать, продать или купить квартиру в 🇹🇷 Турции.

<i>📌 Если у Вас нет кнопок, нажмите на квадратик возле микрофона</i> 🎙
''',


    'info_ad_incomplete': '''
🏡 <b>Объявление о недвижимости </b>#{id} 🏡

📐 Площадь: <b>{square} м²</b>
📍 Город: <b>{city}</b>
🏷️ Тип объявления: <u>{ad_type}</u>
📌 Район: <b>{district}</b>
💶 Цена: <b>€{price}</b>

<i>Объявление от: {agency}</i>
{agency_name}
''',
    'agency_name': '<i>🏢 Название агентства: </i>',

    'info_ad_full': '''{result}
<b>🏡 Объявление о недвижимости</b>

<b>Основные характеристики:</b>
• 🛏️ Комнат: <b>{number_rooms}</b>
• 🏢 Этаж: <b>{floor} из {floors_in_house}</b>
• 📐 Площадь: <b>{square} м²</b>
• 📍 Город: <b>{city}</b>
• 📌 Район: <b>{district}</b>
• 💶 Цена: <b>€{price}</b>

<b>📑 Детали сделки:</b>
• Тип объявления: <b>{ad_type}</b>
• Тип недвижимости: <b>{type_property}</b>
• Тип объекта: <i>{object_type}</i>
• Улица: <i>{street}</i>

<b>📝 Описание:</b>
<i>{description}</i>

<b>Дополнительно:</b>
• 🛋️ Мебель: <b>{furniture}</b>
• 🐾 Животные: <b>{animals}</b>
• 👶 Дети: <b>{children}</b>

<b>📞 Контактная информация:</b>
• Имя: <b>{name}</b>
• Телефон: <b>{contact}</b>
• Агентство: <b>{agency}</b>

<i>Объявление от: {agency}</i>
{agency_name}
''',
    'app_ad_accept': '✅ <b>Ваше объявление о недвижимости было опубликовано!!!</b> ✅',
    'app_ad_rejected': '❌ <b>Ваше объявление о недвижимости было отклонено</b> ❌',


    'watch_tutorial': '🎥 Посмотрите видеоинструкцию ⬆️',
    'main_menu': '<b>🏛 Главное меню</b>\n<i>Выбери нужный раздел</i>',
    'choose_ad_type': '🏷 <b>Выберите тип:</b>\nАренда или продажа',
    'choose_property_type': '🏘 <b>Выберите тип недвижимости:</b>',
    'choose_residential_type': '🧱 <i>Выберите тип объекта:</i>',
    'furniture_question': '🛋 <b>Квартира меблирована?</b>',
    'animals_question': '🐶 <b>Разрешено ли проживание с животными?</b>',
    'children_question': '👶 <b>Разрешено ли проживание с детьми?</b>',
    'choose_rooms': '🚪 <b>Выберите планировку (количество комнат):</b>',
    'enter_price': '💶 <b>Введите цену аренды в €:</b>',
    'choose_district': '📍 <b>Выберите район:</b>',
    'enter_street_or_skip': "🛣 <b>Введите название улицы</b> (или нажмите <i>«Пропустить»</i>)",
    'enter_square': '📏 <b>Введите площадь объекта (в м²):</b>',
    'enter_floor': '🪜 <b>На каком этаже находится объект?</b>',
    'enter_floor_total': '🏢 <b>Сколько этажей всего в доме?</b>',
    'enter_description': "📝 <b>Добавьте дополнительное описание объекта</b> (или нажмите <i>«Пропустить»</i>)",
    'attach_photos': '📸 <b>Прикрепите фотографии объекта:</b>\n\n<i>По окончании нажмите "Стоп" для перехода к следующему шагу!</i>',
    'enter_name': '🧑 <b>Укажите ваше имя:</b>',
    'enter_phone': '📞 <b>Оставьте номер телефона:</b>',

    'enter_agency': "<b>Вы размещаете объявление как:</b>\n(пожалуйста, выберите)",
    'realtor': "🏢 Риэлтор (от агентства)",
    'owner': "🧍‍♂️ Собственник",
    'enter_agency_name': '''✏️ <b>Введите название вашего агентства</b>\n<i>(например: Dom Real Estate)</i>''',

    'success_saved': '✅ <b>Объявление успешно сохранено!</b>',

    # Новые тексты для настройки поиска
    'select_ad_type': '🏷 <b>Выберите тип недвижимости:</b>\nАренда или Покупка',
    'select_city': '🏙 <b>Выберите город:</b>',
    'select_apartment_params': '🛋 <b>Выберите параметры квартиры:</b>',
    'select_rent_price': '💶 <b>Выберите стоимость аренды за месяц (€):</b>',
    'select_buy_price': '💵 <b>Выберите стоимость покупки (€):</b>',
    'select_area': '📏 <b>Выберите общую площадь:</b>',
    'select_district': '📍 <b>Выберите район:</b>',
    'select_property_type': '🏘 <b>Выберите тип недвижимости (покупка):</b>',
    'confirm_settings': '✅ <b>Ваши настройки поиска:</b>',


    'ad_type_label': '🏠 <b>Тип:</b>',
    'city_label': '📍 <b>Город:</b>',
    'property_type_label': '🏗 <b>Тип недвижимости:</b>',
    'apartment_params_label': '🏢 Планировка: <b>Параметры квартиры:</b>',
    'area_label': '📐 <b>Площадь:</b>',
    'districts_label': '📌 <b>Районы:</b>',
    'not_selected': '<b>Не выбрано</b>',
    'edit_settings_search': '🔁 <i>Изменить параметры или начать поиск ниже</i>',
    'budget_label':'💶 <b>Бюджет:</b>',

    'search_started': 'Поиск начат!',
    'search_results_found': 'Найдено объявлений:',
    'no_results_found': 'Объявления не найдены.',
    'no_description': 'Нет описания',

    # Карточка объявления
    'realty_card_sale': '🔑 Продажа, Квартира #{id}',
    'realty_card_rent': '🔑 Аренда, Квартира #{id}',
    'rooms_label': '✏️ Комнат: {count}',
    'floor_label': '🏢 Этаж: {floor}/{total}',
    'square_label': '📐 Площадь, м²: {square}',
    'location_label': '📍 Расположение: {city}',
    'street_label': '🌎 Улица: {street}',
    'district_label': '🗺️ Район: {district}',
    'price_label': '💵 Цена: ',
    'price_per_m2_label': '💵 Цена за кв.м: {price_per_m2} {currency}',
    'details_link': '🔗 Подробнее',
    'no_photo': '📷 Фото отсутствует',

    # Кнопки
    'add_to_favorites': '⭐ Добавить в избранное',
    'remove_from_favorites': '✅ Убрать из избранного',
    'share': '📤 Поделиться',
    'make_appointment': '👁 Связаться',
    'contact': '📞 Контакт',
    'next_card': '➡️ Следующая',
    'prev_card': '⬅️ Предыдущая',


    # Тексты для действий
    'leave_phone': '📞 Введите ваш номер телефона для записи на просмотр:',
    'appointment_request_sent': '✅ Запрос на просмотр отправлен! Продавец свяжется с вами.',
    'appointment_notification': '🔔 Новый запрос на просмотр:\nКвартира #{id}\nПользователь: @{username}\nТелефон: {phone}',
    'share_instruction': '📤 Перешлите это сообщение пользователю, с которым хотите поделиться объявлением.',
    'no_contact_info': '📞 Контактная информация отсутствует.',
    'contact_info': '📞 Контакты:\nИмя: {name}\nТелефон: {contact}\nАгентство: {agency}',
    'no_more_cards': '🏠 Больше нет объявлений.',
    'utils': 'Показать ещё 5 ✨',

    # Ошибки
    'realty_not_found': '🏠 Объявление не найдено или удалено.',

    'residential_property': '🏠 Жилая недвижимость',
    'commercial_property': '🏢 Коммерческая недвижимость',
    'land': '🌿 Земельный участок',

    'apartment': '🏢 Квартира',
    'flat': '🏢 Квартира',
    'duplex': '🏘️ Дуплекс',
    'furnished_yes': '✅ Да, меблирована',
    'furnished_no': '❌ Нет, без мебели',

    'animals_yes': '✅ Разрешены',
    'animals_no': '❌ Запрещены',
    'animals_maybe': '❓ По договорённости',

    'children_yes': '✅ Разрешены',
    'children_no': '❌ Запрещены',
    'children_maybe': '❓ По договорённости',

    'skip': '⏭ Пропустить',
    'stop': '⛔️ Стоп',

    'my_ads': '📂 Мои объявления',
    'your_ads': '📂 Ваши объявления:',
    'next_photo': '🔄 Следующее фото',
    'more_detailed': '🔘 Подробнее',
    'no_photos': 'Фотографий нет',
    'hide': '▫️ скрыть',
    'remove_ad': '🗑 Удалить объявление',
    'remove_complete': '✅ Объявление успешно удалено!',

    'no_favorites': 'У вас нет избранных объявлений!',

    'your_list_favorites': '❤️ Ваш список избранного',

    'get_text_info_for_share': '''
🎉 Привет!
Нашёл для тебя крутого бота для недвижимости — @{bot_name}

🔍 Он помогает:
— легко найти дом мечты
— выгодно продать или сдать жильё

📲 Удобно. Быстро. По делу.
Рекомендую! 🚀

⬆️ Жми на ссылку выше и зацени сам''',


    'get_text_info_for_share_to_bot': '''
🎉 Привет! Зацени крутого бота для поиска недвижимости - @{bot_name}!
Он поможет тебе легко найти дом мечты или выгодно продать/сдать недвижимость. 
Переходи по ссылке выше ⬆️⬆️⬆️. Рекомендую! 🚀
''',

    'change_lang': '🌍 Сменить язык',

}